In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the notebook 02 and the alumni table created in the notebook 04 plus a new table called mentorship

In [2]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

In [3]:
%%sql
SELECT * FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(7, 'Grace', 2019, 'Arts'),
 (8, 'Hannah', 2021, 'History'),
 (9, 'Ian', 2020, 'Biology'),
 (10, 'Diana', 2023, 'Biology'),
 (11, 'Alice', 2022, 'Civil Engineering'),
 (12, 'Frank', 2020, 'Social Work')]

In [4]:
%%sql
SELECT * FROM mentorship;

 * postgresql://user:***@localhost:5432/postgres
7 rows affected.

[('Alice', 'Bob', 'Economics'),
 ('Bob', 'Charlie', 'Chemistry'),
 ('Hannah', 'Diana', 'Computer Science'),
 ('Grace', 'Mark', 'History'),
 ('Alice', 'Grace', 'Arts'),
 ('Frank', 'Ian', 'Biology'),
 ('Eve', 'Frank', 'Social Work')]

### 1. Find the names of students whose age is greater than the average age of all students

### 2. Select the names of alumni who studied a major that no current student is studying.

Hint: you can use NOT EXISTS

### 3. Select all students (other than Alice) who are in the same major as Alice.

### 4. Select the name(s) of the youngest student(s). Use a subquery to find the minimum age.

### 5. Find all majors that have more than one student, also select their names. Use a subquery with COUNT.

Hint: use correlated subquery

### 6. Select the names of people who appear both in the students table and the alumni table.

### 7. Find all alumni who studied a major that appears as a mentee’s major in the mentorship table.

### 8. Find all students who are not listed as mentees in the mentorship table.

Hint: you can use NOT EXISTS

### 9. Select the names of mentors whose mentee’s major is different from their own major (mentor major must come from the students or alumni table).

### 10. Select all students whose age is greater than the age of at least one alumni (you may assume alumni have a column for age in your schema, or adapt accordingly).